Tekla Open API Reference for Tekla Structures 2025
FormBorders.RestoreFormSizeAndLocation Method
Overload List
Name | Description
RestoreFormSizeAndLocation(Form)
 Restores the form size and location from the registry.
RestoreFormSizeAndLocation(Window)
 Restores the WPF window size and location from the registry.
Top
See Also
Reference
FormBorders Class
Tekla.Structures.Dialog Namespace